'''
DP공부 -> 점화식을 아는게 중요!
값을 저장 후 사용하는 것
설탕 배달
Nkg -> 입력
출력-> 최소 봉지 개수
3kg,5kg
'''


'''
입력받은 설탕에서 3kg,5kg으로 계속 뺐을때 가장 작은 값을 구하는 것
N=1 -1
N=2 -1
N=3 1
N=4 -1
N=5 1
N=6 3+N(3) 2
N=7 -1
N=8 3+N(5) 2
N=9 3+N(6) 3
N=10 5+N(5) 2
N=11 3+3+5 3
N=12 3+3+3+3 4
N=13 3+5+5 3
N=14 3+N(11) 4
N=15 5+N(10) or 3+N(12) -> 3
N=16 3+N(13) 5+N(11) -> 4
N=17 3+N(14) 5+N(12) -> 5
N=18 3+N(15) 5+(13) -> 4
'''
dp=[-1] * 5001
sugar=int(input())
dp[3]=dp[5]=1


for i in range(6,sugar+1):
    if i % 5 == 0:
        dp[i]=int(i/5)
    
    elif i%3 == 0:
        dp[i]=dp[i-3]+1
        
    elif dp[i-3]>0 and dp[i-5]>0:
        dp[i]=min(dp[i-3],dp[i-5])+1
        

print(dp[sugar])
